app/views/pages/profile.html.erb

              <div class="col-sm-11">
                  <p class="post-title"><span class="post-owner"><a href="/user/<%= User.find(@p.user_id).username %>"><%= User.find(@p.user.id).username %></a> </span> <span class="post-creation">- <%= @p.created_at.to_formatted_s(:short) %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "joe"]]
SELECT "posts".* FROM "posts" WHERE (user_id = 2)  ORDER BY "posts"."created_at" DESC