app/controllers/posts_controller.rb

        def create
            @post = Post.new(post_params)
            @post.user_id = current_user.id
            respond_to do |f|
                if (@post.save)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "This is a test"], ["user_id", 2], ["created_at", "2016-02-03 00:42:59.156620"], ["updated_at", "2016-02-03 00:42:59.156620"]]